124.57.544                    Толстой Л.Н.                  Повести                              2011             5                
4.245.56546                   СтивенсонР.                   Остров_сокровищ                      2014             4
124.121.045					  Куприн И.А.					Белыйпудель							 2012			  3
821.161.1-31                  Толстой Л.Н.                  Анна_Каренина                        2006            15
821.133.1-34                  Олкотт Л.М.                   Маленькие_женщины                    2010             6
821.111-93                    Горовиц Э.                    Белый_пик                            2010             7
128.621.015					  Куприн И.А.                   Гранатовый_браслет					 2010			 14
5462.54  					  Куприн И.А.                   Белое_безмолвие					     2011			  1
821.111 - 93                  Даль Р.                       Ведьмы                               2009             3
82(1-87)                      Пратчетт Т.                   Вор_времени                          2015            11
930(1-77)                     Ключевский В.О.               Исторические_портреты                2006             7
835.54.645                    Пушкин А.С.                   Поэмы                                2014             7
930(1-75)                     Махно Н.И.                    Воспоминания                         1998            12
83.0                          Достоевский Ф.М.              Братья_Карамазовы                    2002            14
821.161.1-31                  Толстой Л.Н.                  Война_и_Мир                          2003            23